Tekla Open API Reference for Tekla Structures 2025
Polymesh.Brep Property
 Gets or sets the polymesh that forms the object geometry.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public FacetedBrep Brep { get; set; }
Public Property Brep As FacetedBrep
	Get
	Set
Property Value
Type: FacetedBrep
See Also
Reference
Polymesh Class
Tekla.Structures.Model Namespace